In [1]:
import pandas as pd
import numpy as np

In [2]:
sales = pd.read_csv('D://Data Analytics//Utkarsh_IMT//Python//exercise//sales.csv')
tgt = pd.read_csv('D://Data Analytics//Utkarsh_IMT//Python//exercise//target.csv')
buds = pd.read_csv('D://Data Analytics//Utkarsh_IMT//Python//exercise//buds.csv')

In [3]:
# Handling Dataset

In [54]:
sales

          Date       City      PID   Sales  Month  Year
0   2024-04-30      Noida  PBUD039   53661      4  2024
1   2024-02-29    Kolkata  PBUD038   60848      2  2024
2   2024-02-29   Gurugram  PBUD039   53505      2  2024
3   2024-07-31   Gurugram  PBUD037  112005      7  2024
4   2024-02-29  Gtr Noida  PBUD034   45895      2  2024
..         ...        ...      ...     ...    ...   ...
499 2024-04-30   Gurugram  PBUD035  106743      4  2024
500 2024-04-30      Delhi  PBUD034   92564      4  2024
501 2024-01-31      Noida  PBUD034   72580      1  2024
502 2024-08-31   Gurugram  PBUD040   67788      8  2024
503 2024-03-31      Noida  PBUD040   82390      3  2024

[504 rows x 6 columns]

In [5]:
sales.shape

(504, 4)

In [6]:
buds.duplicated().sum()

0

In [7]:
# if duplicated found - how do we remove
sales_updated = sales.drop_duplicates(inplace = True) # this drops if the entire row is duplicated
sales_updated = sales.drop_duplicates(['PID']) # if any duplicate found in PID, it will remove, dropping based on specific column 
sales_updated.shape

(7, 4)

In [8]:
print(tgt.isnull().sum())
print(sales.isnull().sum())
print(buds.isnull().sum())

Date      0
Target    0
dtype: int64
Date     0
City     0
PID      0
Sales    0
dtype: int64
Bud_ID     0
Product    0
dtype: int64

In [9]:
sales.dtypes

Date     object
City     object
PID      object
Sales     int64
dtype: object

In [10]:
sales['Date'] = pd.to_datetime(sales['Date'])

In [11]:
sales['Month'] = sales['Date'].dt.month
sales['Year'] = sales['Date'].dt.year

In [12]:
buds.columns

Index(['Bud_ID', 'Product'], dtype='object')

In [13]:
buds.head()

    Bud_ID                Product
0  PBUD034    OnePlus Nord Buds 2
1  PBUD035  Boat Airdopes 181 Pro
2  PBUD036            Sony WF3510
3  PBUD037      RealMe Buds Air 6
4  PBUD038        Noise Aura Buds

In [14]:
tgt.columns

Index(['Date', 'Target'], dtype='object')

In [15]:
tgt.dtypes

Date      object
Target    object
dtype: object

In [16]:
tgt['Date'] = pd.to_datetime(tgt['Date'])
tgt['Month'] = tgt['Date'].dt.month
tgt['Year'] = tgt['Date'].dt.year

In [17]:
tgt.head(2)

        Date Target  Month  Year
0 2024-01-31  3800K      1  2024
1 2024-02-29  3100K      2  2024

In [18]:
tgt['T1'] = pd.to_numeric(tgt['Target'].str.replace('K',''))*1000

In [19]:
tgt.head()

        Date Target  Month  Year       T1
0 2024-01-31  3800K      1  2024  3800000
1 2024-02-29  3100K      2  2024  3100000
2 2024-03-31  3000K      3  2024  3000000
3 2024-04-30  3300K      4  2024  3300000
4 2024-05-31  4000K      5  2024  4000000

In [20]:
# questions - always come to the questions after cleaning, and renaming your dataset

Q1) Find City wise sum of Sales

In [21]:
sales.groupby(['City'])['Sales'].sum().reset_index()

        City    Sales
0      Delhi  6723361
1  Gtr Noida  6942739
2   Gurugram  6563552
3     Jaipur  6622550
4    Kolkata  6780591
5      Noida  7117161

Q2) Find product name wise Sum of Sales

Q3) Find year and month wise sum of Sales

In [22]:
sales.groupby(['Year','Month'])['Sales'].sum().reset_index()

    Year  Month    Sales
0   2024      1  3334592
1   2024      2  3117787
2   2024      3  3235834
3   2024      4  3452048
4   2024      5  3351323
5   2024      6  3637182
6   2024      7  3555840
7   2024      8  3517231
8   2024      9  3623866
9   2024     10  3384701
10  2024     11  3251112
11  2024     12  3288438

Q4) Find year and month wise % contribution of Sales

In [23]:
q4 = sales.copy()

In [24]:
q4['Total_Sales'] = q4['Sales'].sum()

In [25]:
q41= q4.groupby(['Year','Month'])['Sales'].sum().reset_index()

In [26]:
q41['Total_Sales'] = sales['Sales'].sum()

In [27]:
q41['Sales%'] = round((q41['Sales']/q41['Total_Sales'])*100,2)

In [28]:
q41['Sales%'].sum()

100.0

In [29]:
q41.head(2)

   Year  Month    Sales  Total_Sales  Sales%
0  2024      1  3334592     40749954    8.18
1  2024      2  3117787     40749954    7.65

Q5) Find year and month wise Sales, percentage contribution of Sales, Running Sales, Running% of Slaes

In [30]:
q41['Runnin_Sales'] = q41['Sales'].cumsum()

In [31]:
q41['RS%'] = round((q41['Runnin_Sales']/q41['Total_Sales'])*100,2)

In [32]:
q41

    Year  Month    Sales  Total_Sales  Sales%  Runnin_Sales     RS%
0   2024      1  3334592     40749954    8.18       3334592    8.18
1   2024      2  3117787     40749954    7.65       6452379   15.83
2   2024      3  3235834     40749954    7.94       9688213   23.77
3   2024      4  3452048     40749954    8.47      13140261   32.25
4   2024      5  3351323     40749954    8.22      16491584   40.47
5   2024      6  3637182     40749954    8.93      20128766   49.40
6   2024      7  3555840     40749954    8.73      23684606   58.12
7   2024      8  3517231     40749954    8.63      27201837   66.75
8   2024      9  3623866     40749954    8.89      30825703   75.65
9   2024     10  3384701     40749954    8.31      34210404   83.95
10  2024     11  3251112     40749954    7.98      37461516   91.93
11  2024     12  3288438     40749954    8.07      40749954  100.00

Q6) Create a function to find Prod Name wise top N Sales. Use N as argument.

In [33]:
q6 = pd.merge(sales,buds,left_on='PID',right_on='Bud_ID',how='inner')

In [34]:
q61 = q6[['Product','Sales']].sort_values(['Product','Sales'],ascending = [True, False])

In [35]:
q61['Rank'] = q6.groupby(['Product'])['Sales'].rank(ascending = False)

In [36]:
q61 = q61[q61['Rank']<=3]

In [37]:
def Product_Wise_Top_sales(N):
    q61 = q6[['Product','Sales']].sort_values(['Product','Sales'],ascending = [True, False])
    q61['Rank'] = q6.groupby(['Product'])['Sales'].rank(ascending = False)
    q61 = q61[q61['Rank']<=N]
    return q61

In [38]:
Product_Wise_Top_sales(4).head(3)

               Product   Sales  Rank
410  Apple AirPods Pro  133919   1.0
427  Apple AirPods Pro  130335   2.0
29   Apple AirPods Pro  129040   3.0

q7 ) Create a function to find Prod Name wise top N Sales for a specified month. Use N and month as argument.

In [39]:
def P_M_TopSales(M,N):
    q61 = q6[['Product','Sales']][sales['Month']==2].sort_values(['Product','Sales'],ascending = [True, False])
    q61['Rank'] = q61.groupby(['Product'])['Sales'].rank(ascending = False)
    q61 = q61[q61['Rank']<=N]
    return q61

In [40]:
P_M_TopSales(2,3)

                   Product   Sales  Rank
30       Apple AirPods Pro   96600   1.0
147      Apple AirPods Pro   88288   2.0
311      Apple AirPods Pro   86151   3.0
184  Boat Airdopes 181 Pro  119176   1.0
345  Boat Airdopes 181 Pro  100870   2.0
190  Boat Airdopes 181 Pro   94562   3.0
462          JBl Wave Beam   99562   1.0
258          JBl Wave Beam   85130   2.0
28           JBl Wave Beam   83009   3.0
461        Noise Aura Buds  134464   1.0
174        Noise Aura Buds  130746   2.0
400        Noise Aura Buds   61731   3.0
246    OnePlus Nord Buds 2  116185   1.0
233    OnePlus Nord Buds 2   91700   2.0
4      OnePlus Nord Buds 2   45895   3.0
241      RealMe Buds Air 6  127234   1.0
456      RealMe Buds Air 6  110185   2.0
254      RealMe Buds Air 6   77513   3.0
129            Sony WF3510  132746   1.0
197            Sony WF3510  105733   2.0
14             Sony WF3510   58527   3.0

q8) Find Top 3 cities generating highest Sales.

q9) Find MOM% change in Sales for each month.

In [41]:
q9 = sales.copy()

In [42]:
q91 = q9.groupby(['Month'])['Sales'].sum().reset_index()

In [43]:
q91['Pre_M'] = q91['Sales'].shift(1)

In [44]:
q91['Total_Sales'] = sales['Sales'].sum()

In [45]:
q91['MOM%'] = round(((q91['Sales'] - q91['Pre_M'])/q91['Pre_M'])*100,2)

In [46]:
q91
# MOM % = (current sales - previous sales / previous sales) *100

    Month    Sales      Pre_M  Total_Sales  MOM%
0       1  3334592        NaN     40749954   NaN
1       2  3117787  3334592.0     40749954 -6.50
2       3  3235834  3117787.0     40749954  3.79
3       4  3452048  3235834.0     40749954  6.68
4       5  3351323  3452048.0     40749954 -2.92
5       6  3637182  3351323.0     40749954  8.53
6       7  3555840  3637182.0     40749954 -2.24
7       8  3517231  3555840.0     40749954 -1.09
8       9  3623866  3517231.0     40749954  3.03
9      10  3384701  3623866.0     40749954 -6.60
10     11  3251112  3384701.0     40749954 -3.95
11     12  3288438  3251112.0     40749954  1.15

q10) Find City and Prod wise top N Sales. Create a function for the same, use N as the argument

In [47]:
def CP_topN(N):
    q1a = q6[['City','Product','Sales']].sort_values(['City','Product','Sales'],ascending = [True,True,False])
    q1c = q1a.groupby(['City','Product'])['Sales'].sum().reset_index()
    q1c = q1c.sort_values(['City','Sales'],ascending = [True,False])
    q1c['Rank'] = q1c.groupby(['City'])['Sales'].rank(ascending = False)
    return q1c[q1c['Rank']<=N]

In [48]:
CP_topN(3)

         City                Product    Sales  Rank
1       Delhi  Boat Airdopes 181 Pro  1069997   1.0
5       Delhi      RealMe Buds Air 6  1059490   2.0
6       Delhi            Sony WF3510  1003735   3.0
7   Gtr Noida      Apple AirPods Pro  1115812   1.0
12  Gtr Noida      RealMe Buds Air 6  1105515   2.0
10  Gtr Noida        Noise Aura Buds  1043417   3.0
14   Gurugram      Apple AirPods Pro  1158485   1.0
19   Gurugram      RealMe Buds Air 6  1059530   2.0
18   Gurugram    OnePlus Nord Buds 2   967903   3.0
21     Jaipur      Apple AirPods Pro  1081636   1.0
23     Jaipur          JBl Wave Beam  1004572   2.0
25     Jaipur    OnePlus Nord Buds 2   989353   3.0
32    Kolkata    OnePlus Nord Buds 2  1098388   1.0
33    Kolkata      RealMe Buds Air 6  1083141   2.0
29    Kolkata  Boat Airdopes 181 Pro  1016157   3.0
40      Noida      RealMe Buds Air 6  1084908   1.0
35      Noida      Apple AirPods Pro  1079820   2.0
36      Noida  Boat Airdopes 181 Pro  1061878   3.0

In [49]:
q6

,Date,City,PID,Sales,Month,Year,Bud_ID,Product
0,2024-04-30,Noida,PBUD039,53661,4,2024,PBUD039,Apple AirPods Pro
1,2024-02-29,Kolkata,PBUD038,60848,2,2024,PBUD038,Noise Aura Buds
2,2024-02-29,Gurugram,PBUD039,53505,2,2024,PBUD039,Apple AirPods Pro
3,2024-07-31,Gurugram,PBUD037,112005,7,2024,PBUD037,RealMe Buds Air 6
4,2024-02-29,Gtr Noida,PBUD034,45895,2,2024,PBUD034,OnePlus Nord Buds 2
...,...,...,...,...,...,...,...,...
499,2024-04-30,Gurugram,PBUD035,106743,4,2024,PBUD035,Boat Airdopes 181 Pro
500,2024-04-30,Delhi,PBUD034,92564,4,2024,PBUD034,OnePlus Nord Buds 2
501,2024-01-31,Noida,PBUD034,72580,1,2024,PBUD034,OnePlus Nord Buds 2
502,2024-08-31,Gurugram,PBUD040,67788,8,2024,PBUD040,JBl Wave Beam
503,2024-03-31,Noida,PBUD040,82390,3,2024,PBUD040,JBl Wave Beam

q11)

Q15) Find the best-performing product each month and compute how many months each product topped.

In [ ]:
q15 = q6.groupby(['Month','Product'])['Sales'].sum().reset_index().sort_values(['Month','Sales'],ascending = [True, False]).\
groupby('Month').head(1)

In [ ]:
q15['Product'].value_counts().reset_index()

In [ ]:
q6